# IsOptional Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterInfo..::..IsOptional Property
UpdaterInfo Class See Also
---
Whether the updater is optional or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsOptional { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsOptional As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsOptional {
	bool get ();
}
```

# See Also
UpdaterInfo Class
Autodesk.Revit.DB Namespace